{
  "emotional": {
    "love": {
      "nameZh": "愛",
      "color": "#ec4899",
      "description": "角色對伴侶的情感深度與付出意願，是所有親密行為的根本驅動力。數值越高，角色越願意為對方犧牲，但也越容易因失去而痛苦。",
      "impact": {
        "low": "（0）幾乎無情感牽絆，行動多出於習慣、利益或責任，不會主動為對方付出；分離場景衝擊力低，但易製造「你從來沒愛過我」的控訴爆點。",
        "mid": "（1-2）有情感但尚未成為主要行動動機；在曖昧期與升溫期展現最自然的狀態，讀者會感受到情感的萌芽與拉扯。",
        "high": "（3-5）情感深厚到失去理智，是追妻場景的核心驅動力；高愛值加上低信任或高執念，容易產生「愛而不得」的強烈張力。"
      }
    },
    "trust": {
      "nameZh": "信任",
      "color": "#3b82f6",
      "description": "角色對伴侶誠信與動機的信心程度。信任決定了角色在面對模糊訊息時，是傾向相信還是懷疑對方。低信任是誤會事件的肥沃土壤。",
      "impact": {
        "low": "（0）根本不信任對方，任何訊息都往最壞的方向解讀；誤會事件輕易引爆，但角色顯得多疑，需搭配合理創傷背景。",
        "mid": "（1-2）有基本信任但容易動搖；一個假證據或第三者的話就足以引發懷疑，是「信任崩潰」弧線最常見的起點。",
        "high": "（3-5）近乎無條件相信伴侶，在發現真正背叛時會有更強烈的崩潰感；高信任被摧毀後的衝擊是最深刻的虐點之一。"
      }
    },
    "guilt": {
      "nameZh": "愧疚",
      "color": "#a855f7",
      "description": "角色因傷害過伴侶而積累的負罪感。高愧疚值通常在男主意識到錯誤後出現，是他採取追妻行動的主要動機之一。也可能讓角色做出自我懲罰行為。",
      "impact": {
        "low": "（0）沒有內疚感，不會主動承認錯誤；追妻動機偏向「我想要你」而非「我傷害了你」，男主形象容易顯得自私。",
        "mid": "（1-2）開始意識到自己的過失，有不安感但行動上仍猶豫；是「遲來的後悔」場景最自然的狀態。",
        "high": "（3-5）強烈的罪惡感主導行動，甚至因此做出自我懲罰或過度補償行為；是男主下跪、不惜一切代價追妻的最強動力，也可能讓他在拒絕女主的情況下做出奇怪的犧牲型選擇。"
      }
    },
    "obsession": {
      "nameZh": "執念",
      "color": "#ef4444",
      "description": "角色對伴侶難以割捨的心理執著程度，超越理性的迷戀。執念與愛不同：愛是主動給予，執念是無法放手。高執念的角色即使清楚對方不在乎，也會繼續追求。",
      "impact": {
        "low": "（0）能理性地接受分離，不會死纏爛打；分離後的故事推進需要其他事件觸發才能重燃關係。",
        "mid": "（1-2）對對方念念不忘但能自我克制；適合「偶爾失控，但大部分時間裝作無所謂」的曖昧追妻節奏。",
        "high": "（3-5）無法自拔，分離後仍持續盯著對方的一切動態；是「追妻火葬場」情節最有力的人物設定，能讓讀者既心疼又滿足。但過高執念若不加以刻畫心理，容易顯得恐怖而非深情。"
      }
    }
  },
  "social": {
    "wealth": {
      "nameZh": "錢",
      "color": "#f59e0b",
      "description": "角色的財力資源，決定其能動用的物質手段。財力影響角色在利益糾紛、逃離或反擊場景中的籌碼多寡。",
      "impact": {
        "low": "（0）財力薄弱，容易在利益交換場景中處於被動；「被金錢束縛」是常見的阻礙來源。",
        "mid": "（1-2）財力普通，夠用但不能任意揮霍；衝突時財力不是決勝因素，故事重心偏向情感或智力。",
        "high": "（3-5）財力雄厚，能快速解決大部分現實障礙；適合用在「用金錢無法解決感情問題」的反差場景，凸顯情感的無價。"
      }
    },
    "power": {
      "nameZh": "權",
      "color": "#f97316",
      "description": "角色的社會權力與影響力，包括職位、人脈背景帶來的行事便利度。高權力的角色能壓制外部阻礙，但也容易成為對方感到窒息或被控制的原因。",
      "impact": {
        "low": "（0）缺乏話語權，容易被強勢角色或家族壓制；是「弱者逆襲」故事線的常見起點。",
        "mid": "（1-2）有一定職位或背景，能在小範圍內施加影響；故事衝突多來自「夠強但不夠強」的灰色地帶。",
        "high": "（3-5）呼風喚雨，大部分外部障礙都能靠權力解決；但高權力角色在感情上的弱點（被人利用、孤立、不被真心對待）更容易成為核心矛盾。"
      }
    },
    "fame": {
      "nameZh": "名聲",
      "color": "#eab308",
      "description": "角色在公眾眼中的形象與知名度，決定輿論事件的衝擊範圍。名聲越高，輿論風暴的傷害越大；名聲對娛樂圈、豪門類型的故事影響特別顯著。",
      "impact": {
        "low": "（0）默默無聞，輿論攻擊的殺傷力有限；阻礙事件需依賴其他資源。",
        "mid": "（1-2）小有名氣，輿論能造成壓力但不至於毀滅性；負面事件是煩惱而非危機。",
        "high": "（3-5）高知名度，一個流言就能引發全面危機；是娛樂圈類型故事中「公開羞辱」與「輿論反轉」爽點場景的最佳素材。"
      }
    },
    "connections": {
      "nameZh": "人脈",
      "color": "#22c55e",
      "description": "角色能夠調動的人際網絡廣度，決定其在危機時能獲得多少外部援助。人脈廣的角色能在關鍵時刻找到意外的盟友或消息來源。",
      "impact": {
        "low": "（0）孤立無援，關鍵時刻只能靠自己；孤立感可以增加虐點深度，也讓逆襲更有爆發力。",
        "mid": "（1-2）有幾個可信賴的助力，能在關鍵時刻提供一定幫助；是「有人幫你查到真相」類情節的典型設定。",
        "high": "（3-5）人際資源豐富，資訊流通快；容易在「真相揭露」類場景中一次出手翻盤，或讓敵人的陰謀在龐大人脈下無所遁形。"
      }
    }
  },
  "ability": {
    "professional": {
      "nameZh": "專業力",
      "color": "#06b6d4",
      "description": "角色在本職工作領域的能力強度，決定其在職場場景中的話語權與被尊重程度。高專業力是「逆襲打臉」爽點場景的基礎。",
      "impact": {
        "low": "（0）能力普通，需要靠他人或身分背景立足；職場場景中容易被刁難，但也讓成長弧線更有空間。",
        "mid": "（1-2）夠格但不出眾，在標準場景中表現稱職；衝突時不靠能力取勝，偏向智慧或情感。",
        "high": "（3-5）頂尖專業，是業界標杆；適合需要「公開亮相一次震驚所有人」的打臉場景，也讓角色在失去感情時仍有獨立立足的底氣。"
      }
    },
    "action": {
      "nameZh": "行動力",
      "color": "#14b8a6",
      "description": "角色將決定付諸執行的速度與堅定程度，影響其在危機中的反應效率。高行動力的角色不拖泥帶水，能快速轉移或反擊；低行動力則容易陷入猶豫。",
      "impact": {
        "low": "（0）想了很多但做不到，容易在關鍵時刻猶豫不決；適合需要「外力推動改變」的被動型角色。",
        "mid": "（1-2）能在明確目標下行動，但需要一定的觸發點；是大多數故事角色的自然狀態。",
        "high": "（3-5）一旦決定就立刻執行，反應速度快；在追妻場景中能製造密集的「我真的在行動」感，也讓逆襲或出走的場景更有說服力。"
      }
    },
    "intelligence": {
      "nameZh": "智力",
      "color": "#6366f1",
      "description": "角色分析局勢、識破謊言與制定策略的能力。高智力的角色能比別人更快看穿陰謀，但也可能讓他們在感情中過度分析而失去直覺。",
      "impact": {
        "low": "（0）容易被騙，是誤會與操控場景的常見目標；但低智力若搭配高情感深度，能讓讀者感到「他只是太相信你了」的痛。",
        "mid": "（1-2）具備基本判斷力，能在明顯線索下識破謊言；在懸疑類情節中能參與推理但不包辦答案。",
        "high": "（3-5）洞察力極強，很難被矇騙；適合設計「他其實早就知道，但選擇配合」的反向虐點，或在逆襲場景中一手主導翻盤。"
      }
    }
  },
  "information": {
    "nameZh": "真相掌握度",
    "color": "bg-violet-500",
    "description": "角色目前對故事核心真相的了解程度——包括誰在撒謊、誰在操控、以及誰才是真正的受害者。這個資源會隨著真相事件發生而動態變化，直接決定誤會能否被解開。",
    "impact": {
      "low": "（0）完全被矇在鼓裡，所有決定都基於錯誤資訊；是最容易被操控的狀態，也讓誤會事件的傷害最大化。",
      "mid": "（1-2）掌握部分資訊，有所懷疑但缺乏完整拼圖；是大多數「漸進式真相揭露」弧線的中間狀態，能製造「快要知道了」的懸念感。",
      "high": "（3-5）已掌握大部分或全部真相；在此狀態下選擇沉默或隱忍的角色，能讓讀者感受到壓抑的張力，等待最終爆發的一刻。"
    }
  }
}
