{
  "traits": {
    "pride": {
      "nameZh": "自尊",
      "description": "角色對自身尊嚴與面子的重視程度，影響其面對衝突、道歉與示弱的方式。高自尊的角色寧可沉默也不解釋，是誤會與冷戰的主要來源；低自尊則容易自我懷疑、討好對方。",
      "impact": {
        "low": "（0）幾乎不在意面子，容易讓步妥協，傾向討好；故事中少有因自尊引發的衝突，但可能顯得軟弱或沒有底線。",
        "mid": "（1-2）適度在意自尊，能在重要時刻為面子讓關係受損，但仍有迴旋空間；誤會往往停留在「說不清楚」而非完全拒絕溝通。",
        "high": "（3-5）極度重視自尊，絕不主動低頭，越重要的話越說不出口；是「自尊不說」類誤會事件的核心驅動力，也是男主追妻時最大的障礙。"
      }
    },
    "control": {
      "nameZh": "控制欲",
      "description": "角色對局面、關係與他人行為的掌控需求。高控制欲的角色傾向主導一切，無法接受失控；低控制欲則隨遇而安，較易被環境或他人左右。",
      "impact": {
        "low": "（0）對結果漠然，幾乎不試圖主導局面；故事中偏被動，依賴他人或命運推動情節。",
        "mid": "（1-2）有一定掌控意識，在重要事務上會出手干預，但不至於窒息對方；衝突多來自「介入邊界」的模糊地帶。",
        "high": "（3-5）強烈需要掌握一切，難以忍受對方有自己的秘密或選擇；是 CEO 型角色的典型特質，容易引發「你為什麼不信任我」類衝突，也讓對方感到窒息與逃離衝動。"
      }
    },
    "empathy": {
      "nameZh": "共情",
      "description": "角色感知並回應他人情緒的能力。高共情的角色容易被他人的情緒影響，甚至犧牲自己；低共情則以邏輯或利益為主，較難察覺伴侶的心理需求。",
      "impact": {
        "low": "（0）難以理解對方的情感需求，行動多從自身利益出發；會被讀者視為「冷漠」，衝突場景中常錯過對方發出的情感訊號。",
        "mid": "（1-2）能感知到對方的情緒但未必優先響應；在高壓場景中共情能力會被壓制，出現「我知道你難受但我沒辦法」的矛盾行為。",
        "high": "（3-5）極度敏感於他人情緒，容易犧牲自己的需求去照顧對方；若不加入適當的自我保護設定，容易淪為「委屈自己成全別人」的受虐形象。搭配低自我價值（self-worth 創傷）時是最典型的「高共情高痛感」女主。"
      }
    },
    "rationality": {
      "nameZh": "理性",
      "description": "角色以邏輯與分析思考問題的傾向，影響其在情緒高點時的決策品質。高理性的角色即使心碎也能冷靜拆解問題；低理性則容易被情緒淹沒，做出衝動決定。",
      "impact": {
        "low": "（0）幾乎全靠情緒行動，決定往往事後後悔；故事衝突多由衝動觸發，節奏快但容易顯得前後矛盾。",
        "mid": "（1-2）理性與感性拉鋸，在壓力下理性會瓦解；能在「一時衝動後反省」的劇情結構中發揮最大張力。",
        "high": "（3-5）用理性壓制情感，外表冷靜實則痛苦；是「越在意越表現得無所謂」型角色的核心，適合 CEO 女主——高理性反而讓讀者更心疼她無法說出口的委屈。"
      }
    },
    "impulse": {
      "nameZh": "衝動",
      "description": "角色在壓力或情緒刺激下做出非理性即時反應的傾向。高衝動的角色容易口不擇言或做出後悔的決定；低衝動則過於克制，感情表達困難。",
      "impact": {
        "low": "（0）極度壓抑反應，幾乎不會在情緒高點做出激進行為；雖然穩定，但也容易讓讀者感覺「他/她根本不在乎」。",
        "mid": "（1-2）偶爾衝動但能事後補救；最容易觸發「說錯話—後悔—道歉」的標準情感修復弧線。",
        "high": "（3-5）習慣性的即時反應，容易在關鍵場景說出傷人的話或做出過激行為；是引發不可挽回誤會的主要源頭，也是虐點場景的天然催化劑。"
      }
    },
    "attachment": {
      "nameZh": "依附",
      "description": "角色對親密關係的需求強度，以及對失去對方的恐懼程度。高依附的角色對伴侶極度依賴，分離會造成強烈心理創傷；低依附則自給自足，不易被關係束縛。",
      "impact": {
        "low": "（0）高度獨立，不需要對方的陪伴或認可；分離場景衝擊力弱，但也讓「終於在乎」的轉折顯得更有分量。",
        "mid": "（1-2）有情感連結但能獨立運作；在「若即若離」的曖昧期最能展現張力，不會顯得過於黏膩或過於疏離。",
        "high": "（3-5）對失去關係的恐懼極強，容易因為害怕被拋棄而先發制人地推開對方；是「我先離開比較不痛」型角色的核心，也是追妻場景中男主執念的最佳戲劇根源。"
      }
    }
  }
}
